&НаКлиенте
Перем АС_ВидимостьДоУслуги;

&НаКлиенте
&После("ПриОткрытии")
Процедура АС_ПриОткрытииПосле(Отказ)

	АС_ОбновитьВидимостьРаботы();

КонецПроцедуры

&НаКлиенте
&После("ТипНоменклатурыПриИзменении")
Процедура АС_ТипНоменклатурыПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьРаботы();

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьВидимостьРаботы()

	ЭтоУслуга = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");

	Если ЭтоУслуга Тогда
		Если АС_ВидимостьДоУслуги = Неопределено Тогда
			АС_СохранитьВидимостьДоУслуги();
		КонецЕсли;

		АС_СкрытьПоляДляУслуги();
	Иначе
		АС_ВосстановитьВидимостьДоУслуги();
		Элементы.АС_Работа.Видимость = Ложь;
		УправлениеФормой();
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура АС_СохранитьВидимостьДоУслуги()

	АС_ВидимостьДоУслуги = Новый Соответствие;
	АС_СохранитьВидимостьКоллекции(Элементы.ЛеваяКолонка.ПодчиненныеЭлементы);
	АС_СохранитьВидимостьКоллекции(Элементы.ПраваяКолонка.ПодчиненныеЭлементы);
	АС_СохранитьВидимостьКоллекции(Элементы.ОсновныеРеквизиты.ПодчиненныеЭлементы);

КонецПроцедуры

&НаКлиенте
Процедура АС_СохранитьВидимостьКоллекции(КоллекцияЭлементов)

	Для каждого ЭлементФормы Из КоллекцияЭлементов Цикл
		АС_ВидимостьДоУслуги.Вставить(ЭлементФормы.Имя, ЭлементФормы.Видимость);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АС_СкрытьПоляДляУслуги()

	Для каждого ЭлементФормы Из Элементы.ЛеваяКолонка.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = ЭлементФормы.Имя = "ОсновныеРеквизиты";
	КонецЦикла;

	Для каждого ЭлементФормы Из Элементы.ПраваяКолонка.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = Ложь;
	КонецЦикла;

	Элементы.ОсновныеРеквизиты.Видимость = Истина;
	Для каждого ЭлементФормы Из Элементы.ОсновныеРеквизиты.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = ЭлементФормы.Имя = "ГруппаТипНоменклатуры" ИЛИ ЭлементФормы.Имя = "АС_Работа";
	КонецЦикла;

	Элементы.АС_Работа.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АС_ВосстановитьВидимостьДоУслуги()

	Если АС_ВидимостьДоУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для каждого ИмяИВидимость Из АС_ВидимостьДоУслуги Цикл
		ЭлементФормы = Элементы.Найти(ИмяИВидимость.Ключ);
		Если ЭлементФормы <> Неопределено Тогда
			ЭлементФормы.Видимость = ИмяИВидимость.Значение;
		КонецЕсли;
	КонецЦикла;

	АС_ВидимостьДоУслуги = Неопределено;

КонецПроцедуры
