Функция ВидЦенКонтрагента(Контрагент) Экспорт

	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты")
		Или Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    ВидыЦенКонтрагентов.ВидЦен КАК ВидЦен
	|ИЗ
	|    РегистрСведений.АС_ВидыЦенКонтрагентов КАК ВидыЦенКонтрагентов
	|ГДЕ
	|    ВидыЦенКонтрагентов.Контрагент = &Контрагент
	|    И НЕ ВидыЦенКонтрагентов.ВидЦен.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЦен;
	КонецЕсли;

	Возврат ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");

КонецФункции
