&НаКлиенте
&Вместо("РозничныйВидЦенНачалоВыбора")
Процедура АС_РозничныйВидЦенНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// Для РМК разрешены в том числе виды цен с автоматическим расчетом.
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ВидыЦен.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
&Вместо("РозничныйВидЦенАвтоПодбор")
Процедура АС_РозничныйВидЦенАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ЦенообразованиеВызовСервера.ВидЦеныАвтоПодборДанныеВыбора(
		Текст, ПараметрыПолученияДанных);

КонецПроцедуры

&НаКлиенте
&Вместо("РозничныйВидЦенОкончаниеВводаТекста")
Процедура АС_РозничныйВидЦенОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура;
	ДанныеВыбора = ЦенообразованиеВызовСервера.ВидЦеныАвтоПодборДанныеВыбора(
		Текст, СтруктураОтбора);

КонецПроцедуры

&НаКлиенте
&Вместо("РозничныйВидЦенПриИзменении")
Процедура АС_РозничныйВидЦенПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.РозничныйВидЦен) Тогда
		Возврат;
	КонецЕсли;

	ДанныеВидаЦен = ПолучитьДанныеРозничногоВидаЦен(Объект.РозничныйВидЦен);
	Если Не ДанныеВидаЦен.РассчитыватьАвтоматически Тогда
		ПродолжитьВызов(Элемент);
		Возврат;
	КонецЕсли;

	// Штатное ограничение по национальной валюте сохраняем.
	Если ДанныеВидаЦен.ВалютаЦены <> ДанныеВидаЦен.НациональнаяВалюта Тогда
		ТекстСообщения = НСтр("ru = 'У вида цен ""%ВидЦен%"", для розничной структурной единицы, должна быть задана национальная валюта (%НацВалюта%).'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВидЦен%", ДанныеВидаЦен.НаименованиеВидаЦен);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НацВалюта%", ДанныеВидаЦен.НациональнаяВалюта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.РозничныйВидЦен");
		Объект.РозничныйВидЦен = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&Вместо("ОбработкаОповещения")
Процедура АС_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия <> "ИзменилсяРозничныйВидЦены" Тогда
		ПродолжитьВызов(ИмяСобытия, Параметр, Источник);
		Возврат;
	КонецЕсли;

	Если Не Параметр.РассчитыватьАвтоматически Тогда
		ПродолжитьВызов(ИмяСобытия, Параметр, Источник);
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.РозничныйВидЦен)
		Или Объект.РозничныйВидЦен = Источник.Объект.Ссылка Тогда
		Объект.РозничныйВидЦен = Источник.Объект.Ссылка;
	КонецЕсли;
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры
