&НаСервере
Процедура АС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("Сотрудник")
		Или НЕ ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	СотрудникФормы = Параметры.Сотрудник;
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецДня(ТекущаяДата());
	АС_ОбновитьДанныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура АС_ПериодПриИзменении(Элемент)

	АС_ОбновитьДанныеНаСервере();
	АС_Продажи.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьПродажи(Команда)

	АС_ОбновитьДанныеНаСервере();
	АС_Продажи.Обновить();

КонецПроцедуры

&НаСервере
Процедура АС_ОбновитьДанныеНаСервере()

	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	АС_Продажи.Параметры.УстановитьЗначениеПараметра("Сотрудник", СотрудникФормы);
	АС_Продажи.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода);
	АС_Продажи.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецПериода);

	Запрос = Новый Запрос(АС_ТекстЗапросаИтогов());
	Запрос.УстановитьПараметр("Сотрудник", СотрудникФормы);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоПродаж = Выборка.КоличествоПродаж;
		СуммаПродаж = Выборка.СуммаПродаж;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ТекстЗапросаИтогов()

	Возврат "ВЫБРАТЬ
	| ЕСТЬNULL(СУММА(СтрокиТоваров.Количество), 0) КАК КоличествоПродаж,
	| ЕСТЬNULL(СУММА(СтрокиТоваров.Сумма), 0) КАК СуммаПродаж
	|ИЗ
	| Документ.ЗаказПокупателя.Запасы КАК СтрокиТоваров
	|  ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказ
	|  ПО СтрокиТоваров.Ссылка = Заказ.Ссылка
	|ГДЕ
	| НЕ Заказ.ПометкаУдаления
	| И СтрокиТоваров.АС_Продавец = &Сотрудник
	| И Заказ.Дата МЕЖДУ &НачалоПериода И &КонецПериода";

КонецФункции

&НаКлиенте
Процедура АС_ПродажиВыбор(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьЗначение(Элемент.ТекущиеДанные.ЗаказПокупателя);

КонецПроцедуры
