&НаКлиенте
&После("ПриОткрытии")
Процедура АС_ПриОткрытииПосле(Отказ)

	АС_ОбновитьВидимостьЭлементов();
	АС_ЗаполнитьДатуСозданияФормы();
	АС_НастроитьУсловноеОформлениеОбязательныхПолей();

КонецПроцедуры

&НаСервере
Процедура АС_ЗаполнитьДатуСозданияФормы()

	АС_ДатаСоздания = Объект.ДатаСоздания;

КонецПроцедуры

&НаСервере
Процедура АС_НастроитьУсловноеОформлениеОбязательныхПолей()

	АС_ДобавитьУсловноеОформлениеОбязательногоПоля("АС_ОПФ");
	АС_ДобавитьУсловноеОформлениеОбязательногоПоля("АС_НазваниеОрганизации");

КонецПроцедуры

&НаСервере
Процедура АС_ДобавитьУсловноеОформлениеОбязательногоПоля(ИмяПоля)

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);

	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяПоля);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ЮридическоеЛицо";

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

КонецПроцедуры

&НаКлиенте
&После("ВидКонтрагентаПриИзменении")
Процедура АС_ВидКонтрагентаПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("ПокупательПриИзменении")
Процедура АС_ПокупательПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура АС_ПрочиеОтношенияПриИзменении(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("НаименованиеПолноеПриИзменении")
Процедура АС_НаименованиеПолноеПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("НаименованиеКонтактногоЛица_ПриИзменении")
Процедура АС_НаименованиеКонтактногоЛицаПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("НаименованиеКонтактногоЛица_ОбработкаВыбора")
Процедура АС_НаименованиеКонтактногоЛицаОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбора")
Процедура АС_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("СтранаРегистрацииПриИзменении")
Процедура АС_СтранаРегистрацииПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("ВидГосударственногоОрганаПриИзменении")
Процедура АС_ВидГосударственногоОрганаПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("ГоловнойКонтрагентПриИзменении")
Процедура АС_ГоловнойКонтрагентПриИзмененииПосле(Элемент)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("УстановитьНаименованиеПослеРедактированияИстории")
Процедура АС_УстановитьНаименованиеПослеРедактированияИсторииПосле(НаборЗаписей)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&После("ВыполнитьЗаполнениеРеквизитовПоИНН")
Процедура АС_ВыполнитьЗаполнениеРеквизитовПоИННПосле(знач ИНН)

	АС_ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
&Перед("ПередЗаписью")
Процедура АС_ПередЗаписью(Отказ, ПараметрыЗаписи)

	АС_ЭтоНовыйОбъект = НЕ ЗначениеЗаполнено(Объект.Ссылка);

	АС_ЗаполнитьНаименованияЮрЛица();

	Если Вид = "ЮридическоеЛицо" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.АС_ОПФ) Тогда
			Сообщить("Заполните поле «ОПФ».");
			Отказ = Истина;
		КонецЕсли;

		Если ПустаяСтрока(СокрЛП(Объект.АС_НазваниеОрганизации)) Тогда
			Сообщить("Заполните поле «Название».");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если НЕ АС_ТребуетсяАвтомобиль() Тогда
		Возврат;
	КонецЕсли;

	АС_ЗаполнитьЮридическоеНазвание();

	Если НЕ ЗначениеЗаполнено(Объект.АС_МаркаАвтомобиляИзСправочника) Тогда
		Сообщить("Заполните поле «Марка» в разделе «Автомобиль».");
		Отказ = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.АС_МодельАвтомобиляИзСправочника) Тогда
		Сообщить("Заполните поле «Модель» в разделе «Автомобиль».");
		Отказ = Истина;
	КонецЕсли;

	Если АС_ТребуетсяГосНомер()
		И ПустаяСтрока(СокрЛП(Объект.АС_ГосНомерАвтомобиля)) Тогда
		Сообщить("Заполните поле «Гос. номер» в разделе «Автомобиль».");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АС_МаркаАвтомобиляПриИзменении(Элемент)

	АС_ЗаполнитьЮридическоеНазвание();

КонецПроцедуры

&НаКлиенте
Процедура АС_МаркаАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Ожидание = Ложь;
	ДанныеВыбора = АС_ПолучитьАвтомобилиДляАвтоПодбора(Текст, Истина);

КонецПроцедуры

&НаКлиенте
Процедура АС_МодельАвтомобиляПриИзменении(Элемент)

	АС_ЗаполнитьЮридическоеНазвание();

КонецПроцедуры

&НаКлиенте
Процедура АС_МодельАвтомобиляАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Ожидание = Ложь;
	ДанныеВыбора = АС_ПолучитьАвтомобилиДляАвтоПодбора(
		Текст, Ложь, Объект.АС_МаркаАвтомобиляИзСправочника);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьАвтомобилиДляАвтоПодбора(Текст, ЭтоМарка, Родитель = Неопределено)

	Результат = Новый СписокЗначений;
	Если ПустаяСтрока(СокрЛП(Текст))
		ИЛИ (НЕ ЭтоМарка И НЕ ЗначениеЗаполнено(Родитель)) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 20
		| Автомобили.Ссылка КАК Ссылка,
		| Автомобили.Наименование КАК Наименование
		|ИЗ
		| Справочник.АС_Автомобили КАК Автомобили
		|ГДЕ
		| Автомобили.ЭтоГруппа = &ЭтоГруппа
		| И НЕ Автомобили.ПометкаУдаления
		| И (Автомобили.Наименование ПОДОБНО &СтрокаПоиска
		|  ИЛИ Автомобили.АС_Синонимы ПОДОБНО &СтрокаПоиска)";

	Если НЕ ЭтоМарка Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС
			+ " И Автомобили.Родитель = &Родитель";
		Запрос.УстановитьПараметр("Родитель", Родитель);
	КонецЕсли;

	Запрос.Текст = Запрос.Текст + Символы.ПС
		+ "УПОРЯДОЧИТЬ ПО Автомобили.Наименование";
	Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоМарка);
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СокрЛП(Текст) + "%");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат Результат;

КонецФункции
&НаКлиенте
Процедура АС_ГосНомерАвтомобиляПриИзменении(Элемент)

	Объект.АС_ГосНомерАвтомобиля = ВРег(Объект.АС_ГосНомерАвтомобиля);
	АС_ЗаполнитьЮридическоеНазвание();

КонецПроцедуры

&НаКлиенте
Процедура АС_VINАвтомобиляПриИзменении(Элемент)

	Объект.АС_VINАвтомобиля = ВРег(Объект.АС_VINАвтомобиля);

КонецПроцедуры

&НаКлиенте
Процедура АС_ОПФПриИзменении(Элемент)

	АС_ЗаполнитьНаименованияЮрЛица();

КонецПроцедуры

&НаКлиенте
Процедура АС_НазваниеОрганизацииПриИзменении(Элемент)

	АС_ЗаполнитьНаименованияЮрЛица();

КонецПроцедуры

&НаКлиенте
Процедура АС_ЗаполнитьНаименованияЮрЛица()

	Если НЕ Вид = "ЮридическоеЛицо" Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.АС_ОПФ) Тогда
		Возврат;
	КонецЕсли;

	Название = СокрЛП(Объект.АС_НазваниеОрганизации);
	Если ПустаяСтрока(Название) Тогда
		Возврат;
	КонецЕсли;

	ОПФ = СокрЛП(Строка(Объект.АС_ОПФ));
	Объект.НаименованиеПолное = ОПФ + " «" + Название + "»";
	Объект.Наименование = "«" + Название + "» " + ОПФ;

КонецПроцедуры

&НаКлиенте
Процедура АС_ЗаполнитьЮридическоеНазвание()

	Если НЕ ЗначениеЗаполнено(Объект.АС_МаркаАвтомобиляИзСправочника)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.АС_МодельАвтомобиляИзСправочника) Тогда
		Возврат;
	КонецЕсли;

	Если АС_ТребуетсяГосНомер()
		И ПустаяСтрока(СокрЛП(Объект.АС_ГосНомерАвтомобиля)) Тогда
		Возврат;
	КонецЕсли;

	Марка = СокрЛП(Строка(Объект.АС_МаркаАвтомобиляИзСправочника));
	Модель = СокрЛП(Строка(Объект.АС_МодельАвтомобиляИзСправочника));
	АвтоматическоеНаименование = Марка + " " + Модель;
	Если АС_ТребуетсяГосНомер() Тогда
		ГосНомер = СокрЛП(Объект.АС_ГосНомерАвтомобиля);
		АвтоматическоеНаименование = АвтоматическоеНаименование + " | " + ГосНомер;
	КонецЕсли;
	Объект.НаименованиеПолное = АвтоматическоеНаименование;
	Объект.Наименование = АвтоматическоеНаименование;

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьВидимостьЭлементов()

	ЭтоФизическоеЛицо = Вид = "ФизическоеЛицо";
	ЭтоЮридическоеЛицо = Вид = "ЮридическоеЛицо";
	ВидимостьСкрываемыхЭлементов = НЕ (ЭтоФизическоеЛицо ИЛИ ЭтоЮридическоеЛицо);
	ТребуетсяАвтомобиль = АС_ТребуетсяАвтомобиль();

	АС_УстановитьВидимостьЭлемента("АС_Автомобиль", ТребуетсяАвтомобиль);
	АС_УстановитьВидимостьЭлемента("Наименование", Истина);
	АС_УстановитьВидимостьЭлемента("АС_ОПФ", ЭтоЮридическоеЛицо);
	АС_УстановитьВидимостьЭлемента("АС_НазваниеОрганизации", ЭтоЮридическоеЛицо);
	АС_УстановитьВидимостьЭлемента("ПредставлениеВПрограмме", Ложь);
	АС_УстановитьВидимостьЭлемента("ДекорацияВзаиморасчеты", НЕ ТребуетсяАвтомобиль);
	АС_УстановитьВидимостьЭлемента("ФормаЗаполнитьРеквизитыПоДаннымЕГР", НЕ ТребуетсяАвтомобиль);
	АС_УстановитьВидимостьЭлемента("ГруппаЮридическиеДанные", НЕ ЭтоФизическоеЛицо);
	АС_УстановитьВидимостьЭлемента("ГруппаОсновнойБанковскийСчет", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("Контакты", Истина);
	АС_УстановитьВидимостьЭлемента("ИсточникПривлеченияПокупателя", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("СтатьяДДСПоУмолчанию", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("ГруппаВзаиморасчеты", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("Взаиморасчеты", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("АналитикаВзаиморасчетов", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("ДополнительныеРеквизиты", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("ДобавитьДополнительныйРеквизит", ВидимостьСкрываемыхЭлементов);
	АС_УстановитьВидимостьЭлемента("ГруппаИндексыСПАРКРиски", НЕ ЭтоЮридическоеЛицо);

	АС_ОбновитьВидимостьКонтактнойИнформации(НЕ ЭтоФизическоеЛицо);

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьВидимостьКонтактнойИнформации(Видимость)

	СкрываемыеВиды = Новый Массив;
	СкрываемыеВиды.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента"));
	СкрываемыеВиды.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));
	СкрываемыеВиды.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента"));
	СкрываемыеВиды.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ВебСайтКонтрагента"));
	СкрываемыеВиды.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента"));

	Для Каждого ОписаниеКИ Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		Если СкрываемыеВиды.Найти(ОписаниеКИ.Вид) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		АС_УстановитьВидимостьЭлемента("Группа" + ОписаниеКИ.ИмяРеквизита, Видимость);
		АС_УстановитьВидимостьЭлемента("ГруппаЗаголовок" + ОписаниеКИ.ИмяРеквизита, Видимость);
		АС_УстановитьВидимостьЭлемента(ОписаниеКИ.ИмяРеквизита, Видимость);
		АС_УстановитьВидимостьЭлемента("Комментарий" + ОписаниеКИ.ИмяРеквизита, Видимость);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьВидимостьЭлемента(ИмяЭлемента, Видимость)

	ЭлементФормы = Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Видимость = Видимость;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция АС_ТребуетсяАвтомобиль()

	Возврат (Объект.Покупатель
		И (Вид = "ФизическоеЛицо" ИЛИ Вид = "Самозанятый"))
		ИЛИ (Объект.ПрочиеОтношения И Вид = "ФизическоеЛицо");

КонецФункции

&НаКлиенте
Функция АС_ТребуетсяГосНомер()

	Возврат Объект.Покупатель
		И (Вид = "ФизическоеЛицо" ИЛИ Вид = "Самозанятый")
		И НЕ (Объект.ПрочиеОтношения И Вид = "ФизическоеЛицо");

КонецФункции

&НаКлиенте
&После("ПослеЗаписи")
Процедура АС_ПослеЗаписи(ПараметрыЗаписи)

	Если НЕ АС_ЭтоНовыйОбъект Тогда
		Возврат;
	КонецЕсли;

	АС_ЗаполнитьДатуСозданияОсновногоДоговора();

КонецПроцедуры

&НаСервере
Процедура АС_ЗаполнитьДатуСозданияОсновногоДоговора()

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо Тогда
		Возврат;
	КонецЕсли;

	Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;

	ОбъектДоговора = Договор.ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(ОбъектДоговора.ДатаСоздания) Тогда
		ОбъектДоговора.ДатаСоздания = ТекущаяДатаСеанса();
		ОбъектДоговора.Записать();
	КонецЕсли;

КонецПроцедуры
