&НаКлиенте
Процедура АС_БезДокументовПриИзменении(Элемент)

	АС_ПрименитьОтборБезДокументовНаСервере();

КонецПроцедуры

&НаСервере
Процедура АС_ПрименитьОтборБезДокументовНаСервере()

	Если Не АС_БезДокументов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь);
		Возврат;
	КонецЕсли;

	СписокКонтрагентовБезДокументов = АС_ПолучитьКонтрагентовБезДокументов();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Ссылка", СписокКонтрагентовБезДокументов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьКонтрагентовБезДокументов()

	ТекстыЗапросов = Новый Массив;
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.ДокументыПоКонтрагенту.Состав Цикл
		СтруктураДанных = АС_СтруктураДанныхКритерияОтбора(ЭлементСостава.ПолноеИмя());

		Если СтруктураДанных.ТипОбъекта <> "Документ"
			Или Не ПравоДоступа("Просмотр", СтруктураДанных.Метаданные)
			Или Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(СтруктураДанных.Метаданные) Тогда
			Продолжить;
		КонецЕсли;

		Если ПустаяСтрока(СтруктураДанных.ИмяТаблЧасти) Тогда
			ИмяТаблицы = "Документ." + СтруктураДанных.ВидОбъекта;
		Иначе
			ИмяТаблицы = "Документ." + СтруктураДанных.ВидОбъекта + "." + СтруктураДанных.ИмяТаблЧасти;
		КонецЕсли;

		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		| 	ТаблицаКритерия." + СтруктураДанных.ИмяРеквизита + " КАК Контрагент";
		Если ТекстыЗапросов.Количество() = 0 Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ПОМЕСТИТЬ ВТКонтрагентыВДокументах";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса +
		Символы.ПС + "ИЗ" +
		Символы.ПС + " 	" + ИмяТаблицы + " КАК ТаблицаКритерия" +
		Символы.ПС + "ГДЕ" +
		Символы.ПС + " 	НЕ ТаблицаКритерия." + СтруктураДанных.ИмяРеквизита + " ЕСТЬ NULL";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;

	Если ТекстыЗапросов.Количество() = 0 Тогда
		ТекстЗапроса = "";
	Иначе
		ТекстЗапроса = СтрСоединить(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
		ТекстЗапроса = ТекстЗапроса +
		Символы.ПС + ";" +
		Символы.ПС + "ВЫБРАТЬ РАЗЛИЧНЫЕ" +
		Символы.ПС + " 	Контрагенты.Ссылка КАК Контрагент" +
		Символы.ПС + "ИЗ" +
		Символы.ПС + " 	Справочник.Контрагенты КАК Контрагенты" +
		Символы.ПС + " 	ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтрагентыВДокументах КАК КонтрагентыВДокументах" +
		Символы.ПС + " 	ПО Контрагенты.Ссылка = КонтрагентыВДокументах.Контрагент" +
		Символы.ПС + "ГДЕ" +
		Символы.ПС + " 	НЕ Контрагенты.ЭтоГруппа" +
		Символы.ПС + " 	И КонтрагентыВДокументах.Контрагент ЕСТЬ NULL";
	КонецЕсли;

	Если ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		| 	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		| 	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		| 	НЕ Контрагенты.ЭтоГруппа";
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	СписокКонтрагентов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКонтрагентов.Добавить(Выборка.Контрагент);
	КонецЦикла;

	Возврат СписокКонтрагентов;

КонецФункции

&НаСервереБезКонтекста
Функция АС_СтруктураДанныхКритерияОтбора(ПутьКДанным)

	СтруктураДанных = Новый Структура;
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("ТипОбъекта");
	ИменаПолей.Добавить("ВидОбъекта");
	ИменаПолей.Добавить("ПутьКДанным");
	ИменаПолей.Добавить("ИмяТаблЧасти");
	ИменаПолей.Добавить("ИмяРеквизита");

	Для Индекс = 1 По 3 Цикл
		ПозицияТочки = СтрНайти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, ПозицияТочки - 1);
		СтруктураДанных.Вставить(ИменаПолей[Индекс - 1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, ПозицияТочки + 1);
	КонецЦикла;

	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	Если СтруктураДанных.ПутьКДанным = "ТабличнаяЧасть" Тогда
		Для Индекс = 4 По 5 Цикл
			ПозицияТочки = СтрНайти(ПутьКДанным, ".");
			Если ПозицияТочки = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, ПозицияТочки - 1);
			КонецЕсли;
			СтруктураДанных.Вставить(ИменаПолей[Индекс - 1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным, ПозицияТочки + 1);
		КонецЦикла;
	Иначе
		СтруктураДанных.Вставить("ИмяТаблЧасти", "");
		СтруктураДанных.Вставить("ИмяРеквизита", ПутьКДанным);
	КонецЕсли;

	СтруктураДанных.Вставить("Метаданные", Метаданные.Документы[СтруктураДанных.ВидОбъекта]);
	Возврат СтруктураДанных;

КонецФункции
