&После("ОбработкаПолученияДанныхВыбора")
Процедура АС_ОбработкаПолученияДанныхВыбораПосле(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	КлючАртикула = АС_НоменклатураСервер.КомпактныйКлючАртикула(Параметры.СтрокаПоиска);
	Если ПустаяСтрока(КлючАртикула) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючАртикула", "%" + КлючАртикула + "%");
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 15
		| Номенклатура.Ссылка КАК Ссылка,
		| Номенклатура.Наименование КАК Наименование,
		| Номенклатура.Артикул КАК Артикул
		|ИЗ
		| Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		| НЕ Номенклатура.ЭтоГруппа
		| И НЕ Номенклатура.ПометкаУдаления
		| И НЕ Номенклатура.Недействителен
		| И Номенклатура.АС_АртикулДляПоиска ПОДОБНО &КлючАртикула";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(ДанныеВыбора) <> Тип("СписокЗначений") Тогда
			ДанныеВыбора = Новый СписокЗначений;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;

		Если ДанныеВыбора.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ВыделенныйАртикул = Новый ФорматированнаяСтрока(
			Выборка.Артикул,
			Новый Шрифт(,,Истина),
			WebЦвета.ЗеленыйЛес);
		Представление = Новый ФорматированнаяСтрока(
			ВыделенныйАртикул,
			" (" + Выборка.Наименование + ")");
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
	КонецЦикла;

КонецПроцедуры
