&После("ОбработкаЗаполнения")
Процедура АС_ПослеОбработкиЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	АС_ОчиститьКатегориюУслуги();

КонецПроцедуры

&После("ПриЗаписи")
Процедура АС_ПослеПриЗаписи(Отказ)

	АС_ОчиститьКатегориюУслуги();

КонецПроцедуры

Процедура АС_ОчиститьКатегориюУслуги()

	Если ЭтоГруппа
		Или ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат;
	КонецЕсли;

	КатегорияНоменклатуры = ПредопределенноеЗначение(
		"Справочник.КатегорииНоменклатуры.ПустаяСсылка");

КонецПроцедуры
