&После("ОбработкаЗаполнения")
Процедура АС_ПослеОбработкиЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	АС_ОчиститьКатегориюУслуги();
	АС_ЗаполнитьРеквизитыСозданияУслуги();

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура АС_ПередЗаписьюПеред(Отказ)

	АС_ЗаполнитьРеквизитыСозданияУслуги();

КонецПроцедуры

&После("ПриЗаписи")
Процедура АС_ПослеПриЗаписи(Отказ)

	АС_ОчиститьКатегориюУслуги();

КонецПроцедуры

Процедура АС_ЗаполнитьРеквизитыСозданияУслуги()

	Если ОбменДанными.Загрузка
		Или ЭтоГруппа
		Или ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		СотрудникиПользователя = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(
			Пользователи.ТекущийПользователь());
		Если СотрудникиПользователя.Количество() > 0 Тогда
			Ответственный = СотрудникиПользователя[0];
		Иначе
			Ответственный = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

Процедура АС_ОчиститьКатегориюУслуги()

	Если ЭтоГруппа
		Или ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
		Возврат;
	КонецЕсли;

	КатегорияНоменклатуры = ПредопределенноеЗначение(
		"Справочник.КатегорииНоменклатуры.ПустаяСсылка");

КонецПроцедуры
