Функция НастройкиОформления() Экспорт

	ОбщаяИндикация = ПредопределенноеЗначение(
		"Справочник.АС_НастройкиИндикацииОстатков.ОбщаяИндикация");
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|Настройки.Ссылка КАК Настройка,
		|Настройки.Номенклатура КАК Номенклатура,
		|НастройкиПороги.Количество КАК ВерхняяГраница,
		|НастройкиПороги.ЦветHEX КАК ЦветHEX,
		|ВЫБОР
		|	КОГДА Настройки.Ссылка = &ОбщаяИндикация
		|		ТОГДА 1
		|	ИНАЧЕ 0
		|КОНЕЦ КАК ЭтоОбщаяИндикация
		|ИЗ
		|Справочник.АС_НастройкиИндикацииОстатков КАК Настройки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АС_НастройкиИндикацииОстатков.Пороги КАК НастройкиПороги
		|	ПО Настройки.Ссылка = НастройкиПороги.Ссылка
		|ГДЕ
		|НЕ Настройки.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|ЭтоОбщаяИндикация УБЫВ,
		|Настройки.Номенклатура,
		|НастройкиПороги.Количество");
	Запрос.УстановитьПараметр("ОбщаяИндикация", ОбщаяИндикация);

	Правила = Новый Массив;
	ИсключенияОбщейИндикации = Новый Массив;
	ПредыдущаяНастройка = Неопределено;
	НижняяГраница = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Настройка <> ПредыдущаяНастройка Тогда
			ПредыдущаяНастройка = Выборка.Настройка;
			НижняяГраница = Неопределено;
			Если Выборка.ЭтоОбщаяИндикация = 0
				И ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				ИсключенияОбщейИндикации.Добавить(Выборка.Номенклатура);
			КонецЕсли;
		КонецЕсли;

		Попытка
			ЦветФона = РаботаСЦветомСервер.ЦветПоHEX(Выборка.ЦветHEX);
		Исключение
			Продолжить;
		КонецПопытки;
		Правила.Добавить(Новый Структура(
			"Номенклатура,ВерхняяГраница,НижняяГраница,ЦветФона",
			Выборка.Номенклатура,
			Выборка.ВерхняяГраница,
			НижняяГраница,
			ЦветФона));
		НижняяГраница = Выборка.ВерхняяГраница;
	КонецЦикла;

	Возврат Новый Структура(
		"Правила,ИсключенияОбщейИндикации",
		Правила,
		ИсключенияОбщейИндикации);

КонецФункции
