#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПередЗаписью")
Процедура АС_ПередЗаписьюПроверкаПоставщика(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Отказ И Не ОбменДанными.Загрузка
		И ЗначениеЗаполнено(Корреспонденция)
		И ВРег(СокрЛП(Корреспонденция.Наименование)) = ВРег("Возврат")
		И Не ЗначениеЗаполнено(АС_ПоставщикВозврата) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Укажите поставщика для возврата.'"),
			ЭтотОбъект, "АС_ПоставщикВозврата", , Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
