&Вместо("РассчитатьСуммыВСтрокеТЧ")
Процедура АС_РассчитатьСуммыБезЗапрещенныхСкидок(СтрокаТабличнойЧасти, ПараметрыРасчета)

	Если ТабличныеЧастиУНФКлиентСервер.АС_ЭтоСтрокаБезСкидки(СтрокаТабличнойЧасти) Тогда
		ТабличныеЧастиУНФКлиентСервер.АС_РассчитатьСтрокуБезСкидки(
			СтрокаТабличнойЧасти, ПараметрыРасчета);
	Иначе
		ПродолжитьВызов(СтрокаТабличнойЧасти, ПараметрыРасчета);
	КонецЕсли;

КонецПроцедуры

&Вместо("ПродолжитьРасчетСуммыВСтрокеТЧ")
Процедура АС_ПродолжитьРасчетБезЗапрещенныхСкидок(СтрокаТабличнойЧасти, ПараметрыРасчета, КоличествоСтроки)

	// В том числе ответ на уже открытый вопрос о распределении суммы.
	Если ТабличныеЧастиУНФКлиентСервер.АС_ЭтоСтрокаБезСкидки(СтрокаТабличнойЧасти) Тогда
		ТабличныеЧастиУНФКлиентСервер.АС_РассчитатьСтрокуБезСкидки(
			СтрокаТабличнойЧасти, ПараметрыРасчета);
	Иначе
		ПродолжитьВызов(СтрокаТабличнойЧасти, ПараметрыРасчета, КоличествоСтроки);
	КонецЕсли;

КонецПроцедуры
