&НаСервере
&Вместо("СохранитьНастройкиРМКНаСервере")
Функция АС_СохранитьНастройкиРМКНаСервере()

	Если НастройкаРМК.АС_ИспользоватьОсновнуюКассу
		И Не ЗначениеЗаполнено(НастройкаРМК.АС_ОсновнаяКасса) Тогда
		Возврат Новый Структура("ВыполненоУспешно, ТекстПредупрежденийОшибок",
			Ложь, "Выберите основную кассу для наличной выручки РМК.");
	КонецЕсли;
	Если НастройкаРМК.АС_АвтоПоступлениеПоКартам
		И Не ЗначениеЗаполнено(НастройкаРМК.АС_БанковскийСчетКартРМК) Тогда
		Возврат Новый Структура("ВыполненоУспешно, ТекстПредупрежденийОшибок",
			Ложь, "Выберите банковский счёт для оплаты картой в РМК.");
	КонецЕсли;

	Возврат ПродолжитьВызов();

КонецФункции
