&НаСервере
&Вместо("РезультатПоискаПоПодстроке")
Функция АС_РезультатПоискаПоПодстроке(СтрокаРасширенногоПоиска)
	
	МассивНоменклатуры = ПродолжитьВызов(СтрокаРасширенногоПоиска);
	КлючАртикула = АС_НоменклатураСервер.КомпактныйКлючАртикула(СтрокаРасширенногоПоиска);
	
	Если ПустаяСтрока(КлючАртикула) Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючАртикула", "%" + КлючАртикула + "%");
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	| 	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	| 	НЕ Номенклатура.Ссылка В (&МассивНоменклатуры)
	| 	И Номенклатура.АС_АртикулДляПоиска ПОДОБНО &КлючАртикула";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции
