&НаСервере
Процедура АС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АС_ОбновитьПоставщикаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АС_ПриОткрытии(Отказ)
	Если Не Отказ Тогда
		АС_ОбновитьПоставщикаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АС_КорреспонденцияПриИзменении(Элемент)
	АС_ОбновитьПоставщикаНаСервере();
КонецПроцедуры

&НаСервере
Процедура АС_ОбновитьПоставщикаНаСервере()
	ЭтоВозврат = ЗначениеЗаполнено(Объект.Корреспонденция)
		И ВРег(СокрЛП(Объект.Корреспонденция.Наименование)) = ВРег("Возврат");
	Элементы.АС_ПоставщикВозврата.Видимость = ЭтоВозврат;
КонецПроцедуры
