&НаСервере
&После("ПриСозданииНаСервере")
Процедура АС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	РежимАвтоТеста = Ложь;
	Если Параметры.Свойство("АвтоТест", РежимАвтоТеста) И РежимАвтоТеста Тогда
		Возврат;
	КонецЕсли;

	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.АС_ГруппыСинонимовПоиска)
		Или Элементы.Найти("АС_ГруппаСинонимыПоиска") <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ГруппаСинонимов = Элементы.Добавить(
		"АС_ГруппаСинонимыПоиска",
		Тип("ГруппаФормы"),
		Элементы.СтраницаГлавное);
	ГруппаСинонимов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСинонимов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаСинонимов.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ГруппаСинонимов.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаСинонимов.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаСинонимов.ОтображатьЗаголовок = Истина;
	ГруппаСинонимов.Заголовок = "Синонимы";

	СсылкаСинонимов = Элементы.Добавить(
		"АС_СинонимыДляПоиска",
		Тип("ДекорацияФормы"),
		ГруппаСинонимов);
	СсылкаСинонимов.Вид = ВидДекорацииФормы.Надпись;
	СсылкаСинонимов.Заголовок = "Синонимы для поиска";
	СсылкаСинонимов.Гиперссылка = Истина;
	СсылкаСинонимов.УстановитьДействие("Нажатие", "АС_СинонимыДляПоискаНажатие");

КонецПроцедуры

&НаКлиенте
Процедура АС_СинонимыДляПоискаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АС_ГруппыСинонимовПоиска.ФормаСписка");

КонецПроцедуры
