#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ТекстЗапросаИнициализироватьДанныеДокументаЗаказНаряд")
Функция АС_ТекстЗапросаИнициализироватьДанныеДокументаЗаказНаряд()

	ТекстЗапроса = ПродолжитьВызов();

	Маркер = "ЗаказНарядТовары.Ссылка.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Маркер,
		Маркер + Символы.ПС + "И НЕ ЗаказНарядТовары.АС_НеСписывать");

	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
