#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Перед("ОбработкаПроверкиЗаполнения")
Процедура АС_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ВидОперации <> Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд
		ИЛИ ЭтоНовый()
		ИЛИ АС_ТребоватьИсполнителя Тогда
		Возврат;
	КонецЕсли;

	ПроверяемыйРеквизит = ПроверяемыеРеквизиты.Найти("Работы.АС_Исполнитель");
	Если ПроверяемыйРеквизит <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыйРеквизит);
	КонецЕсли;

КонецПроцедуры

&Перед("ПередЗаписью")
Процедура АС_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЭтоНовый() Тогда
		АС_ТребоватьИсполнителя = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
