&НаКлиенте
Перем АС_ПроведениеПодтверждено;

&НаКлиенте
&Перед("ПередЗаписью")
Процедура АС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	Если АС_ПроведениеПодтверждено = Истина Тогда
		АС_ПроведениеПодтверждено = Ложь;
		Возврат;
	КонецЕсли;

	Если АС_ЕстьПрисоединенныеФайлы(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.ОК, "Отсканирован");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Не отсканирован");
	ПоказатьВопрос(
		Новый ОписаниеОповещения("АС_ПодтверждениеСканированияНакладнойЗавершение", ЭтотОбъект),
		"Бумажный вариант приходной накладной отсканирован?",
		Кнопки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ЕстьПрисоединенныеФайлы(СсылкаНаДокумент) Экспорт

	Если Не ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат РаботаСФайламиСлужебныйВызовСервера.КоличествоПрисоединенныхФайлов(СсылкаНаДокумент) > 0;

КонецФункции

&НаКлиенте
Процедура АС_ПодтверждениеСканированияНакладнойЗавершение(Результат, Параметры) Экспорт

	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;

	АС_ПроведениеПодтверждено = Истина;
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));

КонецПроцедуры
