&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АС_НастроитьВидФормы();
	АС_ЗаполнитьЦветаПорогов();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	АС_НастроитьВидФормы();
	АС_ЗаполнитьЦветаПорогов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить(
		"АС_ИзмененыНастройкиИндикацииОстатков",
		Объект.Ссылка,
		ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПорогиЦветНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Пороги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ИндексСтроки = Объект.Пороги.Индекс(ТекущиеДанные);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"АС_ВыборЦветаЗавершение",
		ЭтотОбъект,
		ИндексСтроки);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Цвет", ТекущиеДанные.Цвет);
	ОткрытьФорму(
		"ОбщаяФорма.ФормаВыбораЦветаУНФ",
		ПараметрыОткрытия,
		ЭтотОбъект,
		,,,
		ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура АС_ВыборЦветаЗавершение(ВыбранныйЦвет, ИндексСтроки) Экспорт

	Если ВыбранныйЦвет = Неопределено Или ВыбранныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Если ИндексСтроки < Объект.Пороги.Количество() Тогда
		СтрокаПорога = Объект.Пороги[ИндексСтроки];
		СтрокаПорога.Цвет = ВыбранныйЦвет;
		СтрокаПорога.ЦветHEX = АС_HEXПоЦвету(ВыбранныйЦвет);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_HEXПоЦвету(ВыбранныйЦвет)

	Возврат РаботаСЦветомСервер.HEXПоЦвету(ВыбранныйЦвет);

КонецФункции

&НаСервере
Процедура АС_НастроитьВидФормы()

	ЭтоОбщаяИндикация = Объект.Ссылка =
		ПредопределенноеЗначение("Справочник.АС_НастройкиИндикацииОстатков.ОбщаяИндикация");
	Элементы.Номенклатура.Видимость = Не ЭтоОбщаяИндикация;
	Элементы.ОписаниеОбщейИндикации.Видимость = ЭтоОбщаяИндикация;
	Если ЭтоОбщаяИндикация Тогда
		Заголовок = "Общая индикация остатков";
	Иначе
		Заголовок = "Индикация остатков для товара";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АС_ЗаполнитьЦветаПорогов()

	Для Каждого СтрокаПорога Из Объект.Пороги Цикл
		Если ПустаяСтрока(СтрокаПорога.ЦветHEX) Тогда
			СтрокаПорога.Цвет = Новый Цвет(255, 255, 255);
		Иначе
			СтрокаПорога.Цвет = РаботаСЦветомСервер.ЦветПоHEX(СтрокаПорога.ЦветHEX);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
