&НаКлиенте
&После("ОткрытьСтандартныйВопросОбработкиАвтономнойККТ")
Процедура АС_ПодтвердитьАвтономныйЧекПослеВопроса(
	Отказ, СтандартнаяОбработка, ПараметрыОперации, ДополнительныеПараметры)

	Если Отказ Или СтандартнаяОбработка
		Или ПараметрыОперации.Команда <> "CheckFiscalization" Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ПараметрыОперации.Форма) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрыОперации.Форма.ИмяФормы <>
		"Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОперации.Форма.АС_ПодтвердитьАвтономныйЧекРМК();

КонецПроцедуры
