&НаКлиенте
Процедура АС_СписокБанковскиеВыпискиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Не АС_ЗапрещеноРедактированиеСозданныхПоступлений()
		Или Элемент.ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	СсылкаДокумента = Элемент.ТекущиеДанные.Ссылка;
	Если ТипЗнч(СсылкаДокумента) <> Тип("ДокументСсылка.ПоступлениеВКассу")
		И ТипЗнч(СсылкаДокумента) <> Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
		АС_ИмяФормыДокумента = "Документ.ПоступлениеВКассу.ФормаОбъекта";
	Иначе
		АС_ИмяФормыДокумента = "Документ.ПоступлениеНаСчет.ФормаОбъекта";
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Ключ", СсылкаДокумента);
	ФормаДокумента = ПолучитьФорму(
		АС_ИмяФормыДокумента,
		ПараметрыФормы,
		ЭтотОбъект);
	ФормаДокумента.ТолькоПросмотр = Истина;
	ФормаДокумента.Открыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ЗапрещеноРедактированиеСозданныхПоступлений()

	Возврат РольДоступна(Метаданные.Роли.АС_ЗапретитьРедактированиеПоступлений);

КонецФункции
