Процедура ПроверитьОграниченияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если РольДоступна(Метаданные.Роли.АС_ЗапретитьОтменуПроведения)
		И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Вам запрещено отменять проведение документов.'"),
			Источник, , , Отказ);
		Возврат;
	КонецЕсли;

	Если РольДоступна(Метаданные.Роли.АС_ЗапретитьПометкуУдаления)
		И Источник.ПометкаУдаления Тогда
		ПометкаУдаленияБылаУстановлена = Ложь;
		Если Не Источник.ЭтоНовый() Тогда
			ПометкаУдаленияБылаУстановлена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Источник.Ссылка, "ПометкаУдаления");
		КонецЕсли;
		Если Не ПометкаУдаленияБылаУстановлена Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Вам запрещено помечать документы на удаление.'"),
				Источник, , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьРедактированиеПоступленияПередЗаписью(
	Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если РольДоступна(Метаданные.Роли.АС_ЗапретитьРедактированиеПоступлений)
		И Не Источник.ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Созданные документы поступления в кассу и на счет доступны только для просмотра.'"),
			Источник, , , Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьОграниченияПередУдалением(Источник, Отказ) Экспорт

	Если РольДоступна(Метаданные.Роли.АС_ЗапретитьПометкуУдаления) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Вам запрещено удалять документы.'"),
			Источник, , , Отказ);
	КонецЕсли;

КонецПроцедуры
