&Вместо("ОбработатьТаблицу")
Процедура АС_ОбработатьТаблицуБезЗапрещенныхСкидок(ЭтаФорма, Таблица, Действие, ОбъектДействия,
	Значение, ИмяЭлементаНоменклатура, ПараметрыОтбора = Неопределено)

	Отбор = ПараметрыОтбора;
	Если Действие = Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки
		Или Действие = Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой Тогда
		Отбор = ТабличныеЧастиУНФКлиентСервер.АС_ОтборСтрокСоСкидкой(Таблица, ПараметрыОтбора);
	КонецЕсли;
	ПродолжитьВызов(ЭтаФорма, Таблица, Действие, ОбъектДействия,
		Значение, ИмяЭлементаНоменклатура, Отбор);

КонецПроцедуры

&Вместо("РаспределитьСуммуНаСкидки")
Процедура АС_РаспределитьСуммуБезЗапрещенныхСкидок(Таблица, ИмяКолонки,
	СуммаРаспределения, ПараметрыОтбора = Неопределено)

	Отбор = ТабличныеЧастиУНФКлиентСервер.АС_ОтборСтрокСоСкидкой(Таблица, ПараметрыОтбора);
	ПродолжитьВызов(Таблица, ИмяКолонки, СуммаРаспределения, Отбор);

КонецПроцедуры
