#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроверкиЗаполнения")
Процедура АС_ОбработкаПроверкиЗаполненияПосле(Отказ, ПроверяемыеРеквизиты)

	Если ЭтоНовый() Тогда
		// Копия старого заказа тоже считается новым заказом и не должна обходить проверку.
		АС_ТребоватьКоличествоДнейНаВозврат = Истина;
	КонецЕсли;

	Если Не АС_ТребоватьКоличествоДнейНаВозврат Тогда
		Возврат;
	КонецЕсли;

	ПодходящаяНоменклатура = НоменклатураВДокументахСервер.НоменклатураТабличнойЧастиПоТипу(
		ЭтотОбъект,
		Перечисления.ТипыНоменклатуры.Запас);

	Для Каждого СтрокаЗапасы Из Запасы Цикл
		Если ПодходящаяНоменклатура.Найти(СтрокаЗапасы.Номенклатура) = Неопределено
			Или СтрокаЗапасы.АС_КоличествоДнейНаВозврат > 0 Тогда
			Продолжить;
		КонецЕсли;

		КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Запасы",
			СтрокаЗапасы.НомерСтроки,
			"АС_КоличествоДнейНаВозврат");
		ТекстСообщения = НСтр("ru = 'В строке товаров не заполнено количество дней на возврат.'");
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			КонтекстноеПоле,
			,
			Отказ);
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
