&НаСервере
Процедура АС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АС_ПоступлениеЗаказовПоставщикамСервер.ЗаполнитьСтатусыПоступления(Объект);

КонецПроцедуры

&НаСервере
&После("ПриЧтенииНаСервере")
Процедура АС_ПриЧтенииНаСервере(ТекущийОбъект)

	АС_ПоступлениеЗаказовПоставщикамСервер.ЗаполнитьСтатусыПоступления(Объект);

КонецПроцедуры

&НаСервере
&После("КопироватьСтрокиНаСервере")
Процедура АС_КопироватьСтрокиНаСервереПосле(ИмяТЧ, КоличествоСкопированных)

	Если ИмяТЧ <> "Запасы" Или КоличествоСкопированных = 0 Тогда
		Возврат;
	КонецЕсли;

	СкопированныеСтроки = ХранилищеОбщихНастроек.Загрузить(
		"БуферОбменаТабличныеЧасти", "Строки");
	Если СкопированныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяКолонкиИсточника = "АС_ИсточникЗаказПоставщика";
	Если СкопированныеСтроки.Колонки.Найти(ИмяКолонкиИсточника) = Неопределено Тогда
		СкопированныеСтроки.Колонки.Добавить(ИмяКолонкиИсточника, Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	ИмяКолонкиЦены = "АС_ЦенаЗаказаПоставщика";
	Если СкопированныеСтроки.Колонки.Найти(ИмяКолонкиЦены) = Неопределено Тогда
		СкопированныеСтроки.Колонки.Добавить(ИмяКолонкиЦены, Новый ОписаниеТипов("Число"));
	КонецЕсли;

	Для Каждого Строка Из СкопированныеСтроки Цикл
		Строка[ИмяКолонкиИсточника] = Истина;
		Строка[ИмяКолонкиЦены] = Строка.Цена;
	КонецЦикла;
	ХранилищеОбщихНастроек.Сохранить("БуферОбменаТабличныеЧасти", "Строки", СкопированныеСтроки);

КонецПроцедуры
